# ImportOptions3DM Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ImportOptions3DM Methods
ImportOptions3DM Class See Also
---
The ImportOptions3DM type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from BaseImportOptions.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLayerSelection | Get all set layers name which user want to import into Revit.  (Inherited from BaseImportOptions.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetLayerSelection | Set the layers name which user want to import into Revit.  (Inherited from BaseImportOptions.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ImportOptions3DM Class
Autodesk.Revit.DB Namespace